# flake8: noqa
# yapf: disable

# Copyright 2023 The Google Research Authors.
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.
"""Utility library of instructions."""

import functools
import random
import re

import nltk

# pylint: disable=line-too-long
WORD_LIST = [
    '静心沉潜', '目标专一', '洗礼心灵', '涤荡灵魂', '内正其心', '外正其行', '学以修身', '学以增智', '学以提能', '学以致用', '入脑如心', '意解情通', '嵌入灵魂', '学思践悟', '融入血液', '铸入灵魂',
    '日积月累', '勤学不倦', '学在深处', '谋在新处', '干在实处', '引向深入', '推向持久', '见到实效', '稳步提升', '稳中有进', '稳步提高', '全面加强', '全面提升', '全面深化', '全面进步', '全面推进',
    '持续改善', '持续壮大', '持续向好', '持续发展', '扎实推进', '成效显著', '成效明显', '不断深入', '不断优化', '不断增强', '不断改善', '不断巩固', '不断涌现', '不断扩大', '明显提升', '明显增强',
    '明显加强', '明显好转', '显著增强', '更加完善', '更加凸显', '更加巩固', '更加彰显', '更加坚定', '得到增强', '得到提高', '取得突破', '加速形成', '初步形成', '基本形成', '初具规模', '日益规范',
    '日益健全', '扎实推进', '纵深推进', '进展顺利', '深刻转型', '成果丰硕', '逐步完善', '健全完善', '更趋协调', '空前释放', '极大提振', '步伐加快', '均衡普惠', '殷实安康', '卓有成效', '多点开花',
    '亮点纷呈', '硕果累累', '切实加强', '富有成效', '普遍提高', '活力增强', '丰富多彩', '频繁活跃', '健康发展', '形成品牌', '优化提升', '有序推进', '蔚然成形', '大幅提升', '同频共振', '合拍共鸣',
    '力度空前', '举世瞩目', '作用明显', '空前高涨', '竞相迸发', '更加完善', '更加凸显', '更加巩固', '更加彰显', '更加坚定', '更加强劲', '更加响亮', '更加广泛', '更加坚强', '更加鲜明', '不断深入',
    '不断优化', '不断增强', '不断改善', '不断巩固', '不断涌现', '不断扩大', '不断发展', '不断提升', '不断健全', '全面加强', '全面提升', '全面深化', '全面进步', '全面推进', '全面展开', '持续改善',
    '持续壮大', '持续向好', '持续发展', '持续完善', '持续繁荣', '明显提升', '明显增强', '明显加强', '明显好转', '稳步提升', '稳中有进', '稳步提高', '得到增强', '得到提高', '得到改善', '基本建立',
    '基本实现', '基本形成', '更趋完备', '更趋协调', '逐步完善', '逐步扭转', '日益规范', '日益健全', '初步形成', '初步构建', '加速形成', '加快完备', '成效显著', '成效明显', '成果丰硕', '深入推进',
    '深入人心', '大幅提升', '大力实施', '相继问世', '相互促进', '多点开花', '亮点纷呈', '点上出彩', '线上结果', '面上开花', '扎实推进', '显著增强', '取得突破', '初具规模', '扎实推进', '纵深推进',
    '进展顺利', '深刻转型', '健全完善', '空前释放', '极大提振', '步伐加快', '均衡普惠', '殷实安康', '卓有成效', '硕果累累', '切实加强', '富有成效', '普遍提高', '活力增强', '丰富多彩', '频繁活跃',
    '健康发展', '形成品牌', '优化提升', '有序推进', '蔚然成形', '同频共振', '合拍共鸣', '同步实施', '力度空前', '举世瞩目', '作用明显', '空前高涨', '竞相迸发', '名列前茅', '蓬勃发展', '创新推进',
    '有效实施', '广泛弘扬', '普遍增加', '胜利完成', '顺利实施', '焕然一新', '为之一振', '巩固发展', '落地实施', '把握方向', '谋划全局', '研究战略', '制定政策', '科学决策', '保障落实', '亲自推动',
    '跟踪进度', '敲钟问响', '扶危定倾', '力挽狂澜', '亲自挂帅', '亲自出征', '亲自督战', '高屋建瓴', '高举旗帜', '高瞻远瞩', '立论定向', '统揽全局', '协调各方', '领袖风范', '政治智慧', '理论勇气',
    '卓越才能', '人格魅力', '分析形势', '沟通思想', '凝聚共识', '谋划未来', '登高望远', '居安思危', '拓宽视野', '放眼世界', '找到坐标', '找到定位', '紧跟时代', '把握潮流', '胸怀全局', '统筹全局',
    '胸怀大局', '把握大势', '着眼大事', '厚植优势', '自信坚定', '瞄准靶向', '赓续过往', '立足当前', '着眼长远', '具有优势', '占据先机', '得之如宝', '矢之不再', '任务艰巨', '有待提高', '任重道远',
    '历史所鉴', '事业所需', '人心所向', '众望所归', '解剖麻雀', '放下架子', '迈开双腿', '迈开步子', '趟出路子', '吃透两头', '吃透上情', '摸清下情', '把握内情', '了解外情', '听真声音', '挖真问题',
    '找真药方', '心中有数', '心中有谱', '心中有招', '深入基层', '深入群众', '深入一线', '定好盘子', '理清路子', '开对方子', '举旗定向', '定向统领', '凝魂聚力', '摆兵布阵', '谋篇共建', '谋篇布局',
    '巨细靡遗', '前瞻谋划', '科学谋划', '冲锋冲刺', '决战决胜', '站在高处', '望着远处', '抢在前边', '科学部署', '一张蓝图', '蓝图绘就', '路标竖起', '落在细上', '落在小上', '落在实上', '撸起袖子',
    '扑下身子', '盯住主业', '务实笃行', '闻令而行', '听令即行', '立说立行', '少说多干', '真抓实干', '实干兴省', '实绩惠民', '埋头苦干', '求真务实', '常抓不懈', '持之以恒', '一抓到底', '抢先抓早',
    '抓在日常', '严在经常', '横向到边', '纵向到底', '不留死角', '绵绵用力', '久久为功', '一以贯之', '一抓到底', '善作善成', '推动落实', '重点落实', '精准落实', '深化落实', '严字当头', '实字托底',
    '细上着力', '往严里抓', '往实里干', '往细里做', '蓬勃朝气', '盎然锐气', '浩然正气', '夙夜在公', '不舍昼夜', '心无旁骛', '静谧自怡', '一门心思', '一鼓作气', '敢为人先', '披荆斩棘', '抖擞精神',
    '奋发有为', '步步深入', '口令不换', '方向不变', '力度不减', '对标对表', '咬紧牙关', '开拓进取', '一心一意', '心无旁骛', '兢兢业业', '精益求精', '爱岗敬业', '干在实处', '走在前列', '勇立潮头',
    '做出表率', '豁得出去', '顶得上去', '提起气来', '沉下心去', '上热下冷', '上急下慢', '上动下看', '深思熟虑', '源于精神', '始于信心', '敢于担当', '甘于担当', '乐于担当', '勤于担当', '严于担当',
    '善于担当', '精于担当', '敢破敢立', '敢闯敢试', '担责不误', '临难不却', '履险不惧', '受屈不计', '拧拧螺丝', '敲敲脑壳', '再理一理', '再促一促', '再抓一抓', '再推一推', '上级推动', '周边促动',
    '先行带动', '激发动力', '聚集合力', '迸发合力', '增添动力', '汇聚合力', '握指成拳', '同频共振', '合力合拍', '合力攻坚', '统一思想', '提高认识', '认清形势', '明确任务', '加强领导', '精心组织',
    '完善机制', '密切配合', '凝聚共识', '形成合力', '放在心上', '抓在手上', '扛在肩上', '倒逼时限', '倒排工期', '倒查责任', '攻城拔寨', '责任压实', '要求提实', '考核抓实', '层层分解', '落实责任',
    '责任重大', '各司其职', '各负其责', '守土有责', '守土负责', '守土尽责', '重点突破', '落在实处', '围绕节点', '突出重点', '打造亮点', '夯基垒台', '选材备料', '立柱架梁', '抓纲举目', '纲举目张',
    '突出重点', '统筹兼顾', '整体推进', '有序推进', '持续推进', '兜牢底线', '蹄疾步稳', '策马扬鞭', '积极审慎', '集中精力', '聚精会神', '积厚成势', '凝聚荟萃', '辐射带动', '创新引领', '釜底抽薪',
    '源头防控', '多管齐下', '标本兼治', '完善程序', '释放效力', '及时回应', '突破创新', '啃硬骨头', '接烫山芋', '攻坚拔寨', '穿出荆棘', '突出藩篱', '破解难题', '内忧外患', '风雨如磐', '跋山涉水',
    '爬冰卧雪', '草根果腹', '找准路子', '开对方子', '打响牌子', '靶向施策', '区分情况', '分类指导', '对准问题', '抓住要害', '找准穴位', '对准焦距', '对症下药', '精准滴灌', '靶向治疗', '精准发现',
    '精准发力', '精准突破', '精准配对', '无缝对接', '有的放失', '摸到窍门', '找到钥匙', '补钙壮骨', '固根铸魂', '心存敬畏', '手持戒尺', '刀刃向内', '久久为功', '廉洁从政', '廉洁用权', '廉洁修身',
    '廉洁齐家', '河清海晏', '祛病疗伤', '激浊扬清', '打虎生威', '拍蝇显力', '抓早抓小', '动辄则咎', '看准红线', '守住底线', '咬耳扯袖', '红脸出汗', '干干净净', '清清爽爽', '硬硬朗朗', '全程跟踪',
    '动态销账', '精密调度', '精确推进', '精准督察', '精细管理', '指路领航', '拨云去雾', '指路立碑', '承前启后', '继往开来', '谱写篇章', '奠定基础', '高瞻远瞩', '气贯长虹', '内涵丰富', '博大精深',
    '好读易懂', '言约旨深', '主题鲜明', '令人鼓舞', '振聋发聩', '催人奋进', '感染心灵', '气势磅礴', '豪情满怀', '引领方向', '标明路径', '武装头脑', '指导实践', '推动工作', '视野开阔', '气度恢弘',
    '气氛热烈', '气势磅礴', '气场强劲', '气质鲜明', '气象万千', '可喜可贺', '可圈可点', '可赞可颂', '滋润心灵', '引领风尚', '春风化雨', '润物无声', '妥帖工巧', '铿锵有声', '引经据典', '譬喻丰富',
    '心系发展', '情系人民', '勇往直前', '舍生忘死', '勇于攻坚', '善于克难', '执法如山', '刚正不阿', '以法为据', '以理服人', '以情感人', '扎根基层', '默默无闻', '敢亲真清', '热情坦荡', '融商汇智',
    '擷英荟萃', '崇尚创新', '注重协调', '倡导绿色', '厚植开放', '推进共享', '爱国守法', '崇德守信', '文明和善', '热情厚道', '开明包容', '大气豁达', '务实敬业', '勤勉吃苦', '坚韧自强', '敢为人先',
    '崇尚一流', '追求卓越', '坚韧前行', '务实奋斗', '从不屈服', '永不言败', '绝不退缩', '朝气蓬勃', '好学上进', '视野宽广', '开放自信', '系统领会', '深刻理解', '准确把握', '秉承初心', '承梦前行',
    '不忘初心', '赤诚不改', '高举旗帜', '维护核心', '摆脱困境', '撕掉标签', '贴上名片', '鼎力支持', '战略重点', '一号工程', '关键支撑', '根本保障', '重要领域', '应有之义', '春风拂面', '暖意融融',
    '暑威尽退', '金风送爽', '稻菽飘香', '硕果压枝', '瑞雪初霁', '艳阳高照', '天高云淡', '不走弯路', '掌握主动', '先行探索', '变中求新', '创新竞进', '筚路蓝缕', '手胼足胝', '老树新枝', '凤凰涅槃',
    '激发动力', '聚集合力', '迸发合力', '增添动力', '汇聚合力', '不走弯路', '掌握主动', '先行探索', '变中求新', '夯实垒台', '交流经验', '研究问题', '团结协作', '全面覆盖', '精准配对', '人岗相宜',
    '引向深入', '推向持久', '见到实效', '疏导情绪', '解疑释惑', '腾笼换鸟', '凤凰涅槃', '目光明澈', '心中笃定', '严字当头', '实字托底', '干在实处', '走在前列', '撸起袖子', '扑下身子', '盯住主业',
    '务实笃行', '闻令而行', '听令即行', '少说多干', '真抓实干', '埋头苦干', '求真务实', '听真声音', '挖真问题', '找真药方', '乘风破浪', '扬帆远航', '梦在前方', '路在脚下', '插柳成荫', '育种墩苗',
    '事在人为', '疏导情绪', '解疑释惑', '团结协作', '热情关心', '同心同德', '海纳百川', '兼容并蓄', '了解民情', '反映民意', '集中民智', '维护民利', '凝聚民心', '问政于民', '问需于民', '问计于民',
    '融入群众', '融化冷漠', '融通隔阂', '盯紧进度', '敲钟问响', '回归初心', '回归传统', '回归本色', '重塑思想', '重塑作风', '重塑生态', '头脑清醒', '态度鲜明', '行动坚决', '心中有魂', '铁心向党',
    '目光明澈', '心中笃定', '立心铸魂', '成风化人', '凝神聚气', '强根固本', '补钙壮骨', '固根铸魂', '刀刃向内', '真刀真枪', '正风肃纪', '刷新吏治', '戮力同心', '刮骨疗毒', '淬火打磨', '打虎生威',
    '拍蝇显力', '动辄则咎', '触及灵魂', '反腐惩恶', '猛药去疴', '重典治乱', '河清海晏', '祛病疗伤', '咬耳扯袖', '红脸出汗', '干干净净', '清清爽爽', '硬硬朗朗', '全程跟踪', '动态销账', '精密调度',
    '精确推进', '精准督察', '精细管理', '督在实处', '察在要害', '层层剥笋', '深入挖掘', '解剖麻雀', '举一反三', '找出病灶', '分析原因', '勇往直前', '舍生忘死', '勇于攻坚', '善于克难', '执法如山',
    '刚正不阿', '以法为据', '以理服人', '以情感人', '扎根基层', '默默无闻', '法安天下', '德润人心', '科学立法', '严格执法', '公正司法', '全民守法', '敢亲真清', '热情坦荡', '融商汇智', '擷英荟萃',
    '崇尚创新', '注重协调', '倡导绿色', '厚植开放', '推进共享', '铁翼飞旋', '车轮滚滚', '战鹰亮翅', '风展红旗', '沙场点兵', '威武雄壮', '赛场争锋', '勇夺桂冠', '招之即来', '来之能战', '站之必胜',
    '战鼓催征', '爱国守法', '崇德守信', '文明和善', '热情厚道', '开明包容', '大气豁达', '务实敬业', '勤勉吃苦', '坚韧自强', '敢为人先', '崇尚一流', '追求卓越', '坚韧前行', '务实奋斗', '从不屈服',
    '永不言败', '绝不退缩', '朝气蓬勃', '好学上进', '视野宽广', '开放自信', '指路领航', '拨云去雾', '指路立碑', '承前启后', '继往开来', '谱写篇章', '奠定基础', '高瞻远瞩', '气贯长虹', '丰富深邃',
    '立意高远', '思想深刻', '要求具体', '内涵丰富', '博大精深', '好读易懂', '言约旨深', '主题鲜明', '包含关切', '寄托希望', '情真意切', '语重心长', '令人鼓舞', '振聋发聩', '催人奋进', '感染心灵',
    '气势磅礴', '豪情满怀', '引领方向', '标明路径', '武装头脑', '指导实践', '推动工作', '视野开阔', '气度恢弘', '气氛热烈', '气场强劲', '气质鲜明', '气象万千', '可喜可贺', '可圈可点', '可赞可颂',
    '滋润心灵', '引领风尚', '春风化雨', '润物无声', '妥帖工巧', '铿锵有声', '引经据典', '譬喻丰富', '心系发展', '情系人民', '系统领会', '深刻理解', '准确把握', '秉承初心', '承梦前行', '不忘初心',
    '赤诚不改', '高举旗帜', '维护核心', '摆脱困境', '撕掉标签', '贴上名片', '鼎力支持', '责任重大', '使命光荣', '战略重点', '一号工程', '关键支撑', '根本保障', '重要领域', '应有之义', '关键环节',
    '龙头工程', '亮丽名片', '标志话语', '强劲引擎', '春风拂面', '暖意融融', '暑威尽退', '金风送爽', '稻菽飘香', '硕果压枝', '瑞雪初霁', '艳阳高照', '天高云淡', '天阔云舒', '革故鼎新', '不走弯路',
    '掌握主动', '先行探索', '变中求新', '创新竞进', '筚路蓝缕', '手胼足胝', '老树新枝', '凤凰涅槃', '勇于变革', '勇于创新', '勇立潮头', '守正开新', '永不僵化', '永不停滞', '澎湃动力', '彰显实力',
    '标注动力', '激发活力', '乘风破浪', '扬帆远航', '梦在前方', '路在脚下', '插柳成荫', '育种蹲苗', '事在人为', '戮力同心', '疏导情绪', '解疑释惑', '情感关爱', '心理疏导', '帮扶救助', '团结协作',
    '热情关心', '同心同德', '海纳百川', '兼容并蓄', '点亮荧屏', '敢于发声', '善于发声', '坚定自信', '站稳脚跟', '制度设计', '制度建设', '制度安排', '制度完善', '制度保障', '制度衔接', '交流经验',
    '研究问题', '全面覆盖', '人岗相宜', '腾笼换鸟', '前瞻务实', '咨政建言', '增信释疑', '凝聚共识', '反复酝酿', '逐级遴选', '不忘本来', '吸收外来', '面向未来', '先行官', '火车头', '老黄牛', '活地图',
    '辖区通', '减压阀', '助推器', '大熔炉', '主旋律', '接力赛', '朝下看', '往下跑', '向下钻', '俯下身', '沉下心', '听民意', '察民情', '惠民生', '解民忧', '谋民意', '有底气', '接地气', '搭平台',
    '建机制', '出政策', '优服务', '管方向', '把方向', '作决策', '保落实', '俯下身', '沉下心', '听民意', '惠民生', '解民忧', '动脑筋', '谋思路', '出点子', '拿建议', '想办法', '想对策', '花力气',
    '找短板', '瞄靶心', '狠发力', '重实际', '察实情', '讲实话', '出实策', '鼓实劲', '办实事', '求实效', '动真情', '下功夫', '动真章', '求突破', '搞空谈', '踩虚脚', '放哑炮', '挑大梁', '唱主角',
    '当先锋', '树标杆', '做示范', '坐不住', '等不起', '睡不着', '拖不得', '把线头', '打七寸', '破难题', '涉险滩', '克险关', '破坚冰', '攻城堡', '拔城池', '通阻滞', '督任务', '督进度', '督成效',
    '察认识', '察责任', '察作风', '挑大梁', '唱主角', '扛重担', '打硬仗', '当先锋', '树标杆', '站排头', '做示范', '挺在先', '冲在前', '敢发声', '敢拍板', '坐不住', '等不起', '睡不着', '拖不得',
    '能推功', '敢揽过', '善纠错', '定准位', '换好位', '补对位', '正歪树', '治病树', '拔烂树', '护森林', '织铁网', '挥利剑', '出重拳', '敲警钟', '不放纵', '不越轨', '不逾矩', '照镜子', '正衣冠',
    '洗洗澡', '治治病', '无禁区', '零容忍', '挖根源', '祛病灶', '真整改', '不贰过', '案头书', '工具书', '座右铭', '学而信', '学而用', '学而行', '重实际', '察实情', '讲实话', '出实策', '鼓实劲',
    '办实事', '求实效', '动真情', '做到底', '做到位', '做到家', '疏功能', '转方向', '治环境', '补短板', '促协同', '惠民生', '听民声', '访民意', '察民情', '排民忧', '解民难', '重民生', '顺民意',
    '暖民心', '集民智', '惜民力', '帮民富', '解民忧', '保民安', '自觉性', '时效性', '可操作性', '复杂性', '积极性', '实效性', '机制性', '特殊性', '主动性', '有效性', '体制性', '多变性', '创造性',
    '坚定性', '保障性', '危险性', '准确性', '阶段性', '流动性', '盲目性', '目的性', '层次性', '稳定性', '实用性', '预见性', '启发性', '全局性', '科学性', '前瞻性', '警示性', '局部性', '局限性',
    '针对性', '苗头性', '根本性', '约束性', '普遍性', '倾向性', '长期性', '理论性', '典型性', '经常性', '精确性', '系统性', '示范性', '思想性', '果敢性', '完整性', '必要性', '知识性', '坚韧性',
    '多样性', '重要性', '趣味性', '敏感性', '服务性', '先进性', '随意性', '警惕性', '指导性', '优越性', '反复性', '技术性', '思想性', '全局性', '前瞻性', '战略性', '创新性', '守护者', '保护者',
    '守望者', '践行者', '组织者', '协调者', '旁观者', '教育者', '监督者', '管理者', '设计者', '引导者', '实施者', '指导者', '协助者', '决策者', '参与者', '使命感', '责任感', '危机感', '紧迫感',
    '荣誉感', '成就感', '自豪感', '归属感', '认同感', '幸福感', '满足感', '忧郁感', '孤独感', '失落感', '法制化', '规范化', '制度化', '程序化', '集约化', '军事化', '正常化', '有序化', '智能化',
    '优质化', '常态化', '科学化', '年轻化', '知识化', '专业化', '现代化', '规模化', '标准化', '品牌化', '产业化', '信息化', '城镇化', '向心力', '凝聚力', '洞察力', '执行力', '推动力', '战斗力',
    '保障力', '驾驭力', '自控力', '亲和力', '号召力', '感召力', '原动力', '驱动力', '响应力', '控制力', '领导力', '聚合力', '小辩论', '小问答', '小讲评', '小讨论', '小板报', '小朗诵', '小讲座',
    '小创新', '小改革', '小突破', '小提高', '小态度', '小窍门', '小技巧', '小圈子', '小功夫', '小发明', '世界观', '人生观', '价值观', '道德观', '荣辱观', '大局观', '平衡观', '统筹观', '科学观',
    '宗旨观', '和谐观', '政绩观', '得失观', '学习型', '服务型', '实战型', '创新型', '务实型', '节约型', '高效型', '全能型', '复合型', '切入点', '立足点', '着力点', '出发点', '落脚点', '制高点',
    '突破点', '主攻点', '受力点', '结合点', '兴趣点', '关键点', '要点', '重点', '热点', '难点', '焦点', '盲点', '节点', '拐点', '阵地战', '信息战', '攻心战', '心理战', '攻坚战', '电子战', '大会战',
    '座谈会', '现场会', '推进会', '动员会', '部署会', '交流会', '亲近度', '支持度', '理解度', '满意度', '认知度', '认可度', '主动改', '督促改', '推动改', '限期改', '随时改', '保护人', '牵头人',
    '带头人', '领头人', '知情人', '调停人', '内行人', '贴心人', '明白人', '清白人', '正派人', '新形势', '新任务', '新挑战', '新机遇', '新情况', '新问题', '新困难', '新对策', '新办法', '新局面',
    '新气象', '抓苗头', '抓数量', '抓重点', '抓安全', '抓实效', '抓关键', '抓细节', '抓风纪', '抓形象', '抓规范', '抓经济', '抓廉政', '抓成效', '抓稳定', '抓发展', '抓标准', '抓质量', '抓突破',
    '抓建设', '抓管理', '一股绳', '一盘棋', '一颗钉', '一班人', '一条心', '一股劲', '一面旗', '一座山', '一堵墙', '一支笔', '一条枪', '一块砖', '一条龙', '一把手', '多层次', '多角度', '多形式',
    '多渠道', '多功能', '高起点', '高标准', '高要求', '高强度', '高密度', '高水平', '高频率', '高效能', '高同步', '高负荷', '送温暖', '送法律', '送服务', '送爱心', '送平安', '零干扰', '零发案',
    '零投诉', '零积压', '零差错', '零懈怠', '零违纪', '零增长', '零推脱', '零距离', '规模大', '规格高', '规定严', '规范好', '不放松', '不松懈', '不松口', '不动摇', '不携带', '不遗漏', '不脱节',
    '不越位', '不捂盖', '不留面', '不多嘴', '不多事', '不务虚', '不作秀', '不流失', '不丢失', '不打响', '看起点', '看高度', '看认识', '看水平', '看效果', '看成效', '看发展', '看业绩', '看装备',
    '看实力', '看悟性', '看规则', '看潜力', '看回头', '大提高', '大提升', '大跃升', '大跨跃', '大起色', '大动作', '大发展', '大步伐', '大突破', '大发展', '大变化', '大繁荣', '大改善', '大合作',
    '大考验', '大形势', '大氛围', '大开放', '大旅游', '大产业', '大规划', '大规模', '大品牌', '大提速', '大环境', '大建设', '大投入', '大增长', '大调整', '大推进', '大融合', '大碰撞', '大交锋',
    '大检验', '大阅兵', '大方向', '大变革', '大转变', '大检阅', '大集合', '大洗牌', '大决择', '大决战', '大贡献', '大气魄', '大手笔', '大展览', '大平台', '大课题', '大交通', '一种境界', '一种考验',
    '一种标志', '一种障碍', '一种心境', '一种挑战', '一种品牌', '一种歧视', '一种艺术', '一种磨练', '一种榜样', '一种恶习', '一种态度', '一种美德', '一种勇气', '一种打击', '一种心态', '一种品格',
    '一种观念', '一种误会', '一种文化', '一种财富', '一种收获', '一种曲解', '一种科学', '一种方法', '一种快乐', '一种折磨', '一种生活', '一种策略', '一种追求', '一种懦弱', '一种力量', '一种战术',
    '一种鼓励', '一种错误', '一种习惯', '一种感情', '一种渠道', '一种失误', '一种享受', '一种感动', '一种反馈', '一种无奈', '一种选择', '一种责任', '一种解答', '一种罪过', '一种和谐', '一种信任',
    '一种原则', '一种负担', '一种气质', '一种义务', '一种情绪', '一种矛盾', '一种修养', '一种尊重', '一种成功', '一种枷锁', '一种压力', '一种能力', '一种本能', '一种动力', '一种约束', '一种爱好',
    '一种进步', '一种哲学', '一种权利', '一种精神', '一种缘分', '一种尝试', '一种幸福', '一种偶然', '一种实践', '一种幸运', '一种必然', '一种精彩', '一种福气', '一种美丽', '一种过程', '一种智慧',
    '一种魄力', '一种自信', '奉献精神', '创新精神', '务实精神', '求是精神', '坚守精神', '自律精神', '开拓精神', '执着精神', '合作精神', '开放精神', '坚韧精神', '吃苦精神', '和合精神', '诚信精神',
    '实干精神', '进取精神', '拼搏精神', '自强精神', '法治精神', '人文精神', '团结精神', '团队精神', '无私精神', '民主精神', '谦虚精神', '创业精神', '奋斗精神', '科学精神', '攻坚精神', '探索精神',
    '求实精神', '求真精神', '协作精神', '实践精神', '钉子精神', '傻子精神', '蚂蝗精神', '工作阶段', '调研阶段', '部署阶段', '动员阶段', '提高阶段', '排查阶段', '整治阶段', '剖析阶段', '评议阶段',
    '落实阶段', '分析阶段', '评比阶段', '政治意识', '大局意识', '核心意识', '看齐意识', '全局意识', '整体意识', '奉献意识', '谋划意识', '机遇意识', '任务意识', '形象意识', '责任意识', '学习意识',
    '创新意识', '进取意识', '危机意识', '忧患意识', '保护意识', '机构到位', '领导到位', '人员到位', '培训到位', '经费到位', '场地到位', '责任到位', '宣传到位', '想干事', '能干事', '会干事', '干成事',
    '思想作风', '工作作风', '领导作风', '生活作风', '积累', '推进', '推动', '健全', '统领', '协调', '统筹', '转变', '提高', '实现', '适应', '改革', '创新', '扩大', '加强', '促进', '巩固', '保障',
    '方向', '完善', '加快', '振兴', '崛起', '分工', '扶持', '改善', '调整', '优化', '解决', '宣传', '教育', '发挥', '支持', '带动', '帮助', '深化', '规范', '强化', '统筹', '指导', '服务', '健全',
    '确保', '维护', '优先', '贯彻', '实施', '深化', '保证', '鼓励', '引导', '坚持', '深化', '强化', '监督', '管理', '开展', '规划', '整合', '理顺', '推行', '纠正', '严格', '满足', '推广', '遏制',
    '整治', '保护', '健全', '丰富', '夯实', '树立', '尊重', '制约', '适应', '发扬', '拓宽', '拓展', '规范', '改进', '形成', '逐步', '实现', '规范', '坚持', '调节', '取缔', '调控', '把握', '弘扬',
    '借鉴', '倡导', '培育', '打牢', '武装', '凝聚', '激发', '说服', '感召', '尊重', '包容', '树立', '培育', '发扬', '提倡', '营造', '促进', '唱响', '主张', '弘扬', '通达', '引导', '疏导', '着眼',
    '吸引', '塑造', '搞好', '履行', '倾斜', '惠及', '简化', '衔接', '调处', '关切', '汇集', '分析', '排查', '协商', '化解', '动员', '联动', '激发', '增进', '汲取', '检验', '保护', '鼓励', '完善',
    '宽容', '增强', '融洽', '凝聚', '汇集', '筑牢', '考验', '进取', '凝聚', '设置', '吸纳', '造就', '关系', '力度', '速度', '反映', '诉求', '形势', '任务', '要务', '核心', '主体', '水平', '方针',
    '结构', '增量', '比重', '规模', '标准', '办法', '主体', '作用', '特色', '差距', '渠道', '方式', '主导', '纽带', '主体', '载体', '制度', '需求', '能力', '负担', '体系', '重点', '资源', '职能',
    '倾向', '秩序', '途径', '活力', '项目', '工程', '政策', '项目', '环境', '素质', '权利', '利益', '权威', '氛围', '职能', '作用', '事权', '需要', '能力', '基础', '比重', '机制', '举措', '要素',
    '精神', '根本', '地位', '成果', '核心', '精神', '力量', '纽带', '思想', '理想', '活力', '信念', '信心', '风尚', '意识', '正气', '热点', '情绪', '内涵', '管理', '格局', '准则', '网络', '稳定',
    '安全', '支撑', '局面', '环境', '关键', '保证', '本领', '突出', '位置', '特点', '规律', '阵地', '政策', '措施', '制度', '保障', '水平', '紧迫', '任务', '合力', '体系', '机制', '体制', '系统',
    '规划', '战略', '方针', '政策', '措施', '要点', '重点', '焦点', '难点', '热点', '亮点', '矛盾', '问题', '建设', '思想', '认识', '作风', '整治', '环境', '秩序', '作用', '地方', '基层', '传统',
    '运行', '监测', '监控', '调控', '监督', '工程', '计划', '行动', '创新', '增长', '方式', '模式', '转变', '质量', '水平', '效益', '会议', '文件', '精神', '意识', '服务', '协调', '沟通', '力度',
    '领域', '空间', '成绩', '成就', '进展', '实效', '基础', '前提', '关键', '保障', '动力', '条件', '环节', '方法', '思路', '设想', '途径', '道路', '主意', '办法', '力气', '功夫', '台阶', '形势',
    '情况', '意见', '建议', '网络', '指导', '指南', '目录', '方案', '秩序', '敏锐性', '针对性', '有效性', '覆盖面', '结合点', '出发点', '落脚点', '本质属性', '重要保证', '总体布局', '战略任务',
    '内在要求', '重要进展', '决策部署', '突出地位', '最大限度', '指导思想', '体制机制', '基本方略', '理念意识', '基本路线', '基本纲领', '基本经验', '持续', '快速', '协调', '健康', '公平', '公正',
    '公开', '透明', '富强', '民主', '文明', '和谐', '祥和', '优良', '良好', '合理', '稳定', '平衡', '均衡', '稳健', '平稳', '统一', '现代', '新潮', '落后', '滞后', '统一思想', '提高认识', '明确目标',
    '团结奋进', '团结拼搏', '克难而进', '攻坚克难', '积极参与', '高度重视', '认真组织', '精心部署', '总揽全局', '协调各方', '高举旗帜', '服从大局', '加强学习', '提升能力', '求真务实', '提高效能',
    '发扬民主', '增进团结', '抢抓机遇', '开拓创新', '坚定信心', '转变作风', '凝心聚力', '同心同德', '齐心协力', '步调一致', '解放思想', '实事求是', '锤炼作风', '狠抓落实', '敢于创新', '迎难而上',
    '紧扣重点', '奋力推进', '正视差距', '准确把握', '与时俱进', '强化保障', '加强领导', '全力支持', '恪尽职守', '尽职尽责', '勤勉工作', '不负重托', '不辱使命', '认清形势', '振奋精神', '围绕中心',
    '主动作为', '锐意进取', '扎实工作', '全力以赴', '吃透精神', '把握精髓', '未雨绸缪', '突出重点', '统筹兼顾', '集中精力', '乘势而上', '大干快上', '大力拓展', '大力发展', '努力改善', '全力维护',
    '扎实开展', '全力保障', '切实加强'
]

# ISO 639-1 codes to language names.
LANGUAGE_CODES = {
    'en': '英文',
    'zh-cn': '中文'
}


def count_sentences_chinese(text):
    """Count the number of sentences in a Chinese text."""
    # Define a regular expression pattern for Chinese sentence splitting
    # This pattern considers sentences ending with 。, ！, ？, and their full-width counterparts
    sentence_endings = re.compile(r'[\.\!\?。！？]+')

    # Split the text using the defined pattern
    tokenized_sentences = sentence_endings.split(text)

    # Filter out any empty strings that might be considered as sentences
    tokenized_sentences = [sentence for sentence in tokenized_sentences if sentence.strip()]

    return len(tokenized_sentences)


def generate_keywords(num_keywords):
    """Randomly generates a few keywords."""
    return random.sample(WORD_LIST, k=num_keywords)
